/*Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.

3, 5 -> 243 (3⁵)

2, 4 -> 16*/

double AtodegreeB (double A, int B)
{
    if (B<=0)
    {
        System.Console.WriteLine("B must be natural, try again");
        return 0;
    }
    else {
        
    }
}